# hello dhruv panchal its pandas

In [2]:
import numpy as np
import pandas as pd

In [2]:
dic1 = {
    "name": ["dhruv","pravin","chintan","karan"],
    "age" : [15,17,14,18],
    "work": ["it engineer","c.a","ips","c.a"]
}
dic1

{'name': ['dhruv', 'pravin', 'chintan', 'karan'],
 'age': [15, 17, 14, 18],
 'work': ['it engineer', 'c.a', 'ips', 'c.a']}

In [3]:
df = pd.DataFrame(dic1)

In [4]:
df

      name  age         work
0    dhruv   15  it engineer
1   pravin   17          c.a
2  chintan   14          ips
3    karan   18          c.a

In [5]:
df.to_csv("friend.csv")

In [6]:
df.to_csv("friend_index.csv" ,index=False)

In [7]:
df.head(2)

     name  age         work
0   dhruv   15  it engineer
1  pravin   17          c.a

In [8]:
df.tail(2)

      name  age work
2  chintan   14  ips
3    karan   18  c.a

In [9]:
df.describe()

             age
count   4.000000
mean   16.000000
std     1.825742
min    14.000000
25%    14.750000
50%    16.000000
75%    17.250000
max    18.000000

pd.read_csv

to_csv()

.index

loc 

iloc

In [15]:
scr = pd.Series(np.random.rand(20))

In [16]:
type(scr)

pandas.core.series.Series

In [17]:
scr

0     0.942971
1     0.008624
2     0.219856
3     0.496775
4     0.652885
5     0.393664
6     0.077476
7     0.722573
8     0.542919
9     0.611930
10    0.249414
11    0.748874
12    0.205448
13    0.587828
14    0.263190
15    0.131049
16    0.760614
17    0.595939
18    0.897539
19    0.378656
dtype: float64

In [3]:
newdf = pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [6]:
newdf

            0         1         2         3         4
0    0.791900  0.362304  0.102699  0.694570  0.067786
1    0.325216  0.772830  0.567905  0.516477  0.754782
2    0.723062  0.528047  0.115898  0.140173  0.267369
3    0.291336  0.845692  0.759160  0.577017  0.201439
4    0.413158  0.536657  0.521336  0.210386  0.873339
..        ...       ...       ...       ...       ...
329  0.765044  0.678833  0.077451  0.319154  0.076277
330  0.807484  0.697066  0.529902  0.464503  0.238483
331  0.995829  0.697474  0.808878  0.312633  0.969458
332  0.268094  0.356415  0.635099  0.834819  0.521124
333  0.231593  0.062113  0.157689  0.492483  0.885649

[334 rows x 5 columns]

In [20]:
newdf

            0         1         2         3         4
0    0.353408  0.022837  0.046297  0.770105  0.730972
1    0.550071  0.710912  0.967879  0.835901  0.301165
2    0.912403  0.326307  0.496282  0.717827  0.437069
3    0.717718  0.031644  0.243032  0.341656  0.066220
4    0.058916  0.417817  0.609019  0.892734  0.505229
..        ...       ...       ...       ...       ...
329  0.076874  0.878803  0.444928  0.209214  0.743770
330  0.464702  0.171053  0.552225  0.961123  0.046009
331  0.507099  0.731824  0.145087  0.205550  0.841249
332  0.072293  0.103271  0.775265  0.238348  0.102994
333  0.040855  0.529082  0.111757  0.368607  0.539036

[334 rows x 5 columns]

In [21]:
type(newdf)

pandas.core.frame.DataFrame

In [22]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.485570    0.484071    0.508291    0.504063    0.521135
std      0.287340    0.287454    0.288065    0.284388    0.276115
min      0.002636    0.001116    0.008934    0.002831    0.002860
25%      0.239837    0.250353    0.243591    0.264191    0.296660
50%      0.487380    0.476638    0.529580    0.495248    0.542400
75%      0.719749    0.736001    0.763034    0.749058    0.742951
max      0.993798    0.997590    0.991749    0.993065    0.997457

In [25]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [26]:
newdf[0]

0      0.353408
1      0.550071
2      0.912403
3      0.717718
4      0.058916
         ...
329    0.076874
330    0.464702
331    0.507099
332    0.072293
333    0.040855
Name: 0, Length: 334, dtype: float64

In [27]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [28]:
newdf[0][0] = "Dhruv"

In [29]:
newdf

            0         1         2         3         4
0       Dhruv  0.022837  0.046297  0.770105  0.730972
1    0.550071  0.710912  0.967879  0.835901  0.301165
2    0.912403  0.326307  0.496282  0.717827  0.437069
3    0.717718  0.031644  0.243032  0.341656  0.066220
4    0.058916  0.417817  0.609019  0.892734  0.505229
..        ...       ...       ...       ...       ...
329  0.076874  0.878803  0.444928  0.209214  0.743770
330  0.464702  0.171053  0.552225  0.961123  0.046009
331  0.507099  0.731824  0.145087  0.205550  0.841249
332  0.072293  0.103271  0.775265  0.238348  0.102994
333  0.040855  0.529082  0.111757  0.368607  0.539036

[334 rows x 5 columns]

In [30]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [31]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [33]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [34]:
newdf.head(5)

          0         1         2         3         4
0     Dhruv  0.022837  0.046297  0.770105  0.730972
1  0.550071  0.710912  0.967879  0.835901  0.301165
2  0.912403  0.326307  0.496282  0.717827  0.437069
3  0.717718  0.031644  0.243032  0.341656  0.066220
4  0.058916  0.417817  0.609019  0.892734  0.505229

In [35]:
newdf.to_numpy

<bound method DataFrame.to_numpy of             0         1         2         3         4
0       Dhruv  0.022837  0.046297  0.770105  0.730972
1    0.550071  0.710912  0.967879  0.835901  0.301165
2    0.912403  0.326307  0.496282  0.717827  0.437069
3    0.717718  0.031644  0.243032  0.341656  0.066220
4    0.058916  0.417817  0.609019  0.892734  0.505229
..        ...       ...       ...       ...       ...
329  0.076874  0.878803  0.444928  0.209214  0.743770
330  0.464702  0.171053  0.552225  0.961123  0.046009
331  0.507099  0.731824  0.145087  0.205550  0.841249
332  0.072293  0.103271  0.775265  0.238348  0.102994
333  0.040855  0.529082  0.111757  0.368607  0.539036

[334 rows x 5 columns]>

In [36]:
newdf[0][0]=0.333

In [37]:
newdf.head

<bound method NDFrame.head of             0         1         2         3         4
0       0.333  0.022837  0.046297  0.770105  0.730972
1    0.550071  0.710912  0.967879  0.835901  0.301165
2    0.912403  0.326307  0.496282  0.717827  0.437069
3    0.717718  0.031644  0.243032  0.341656  0.066220
4    0.058916  0.417817  0.609019  0.892734  0.505229
..        ...       ...       ...       ...       ...
329  0.076874  0.878803  0.444928  0.209214  0.743770
330  0.464702  0.171053  0.552225  0.961123  0.046009
331  0.507099  0.731824  0.145087  0.205550  0.841249
332  0.072293  0.103271  0.775265  0.238348  0.102994
333  0.040855  0.529082  0.111757  0.368607  0.539036

[334 rows x 5 columns]>

In [38]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.333,0.550071,0.912403,0.717718,0.058916,0.514342,0.135178,0.544595,0.420583,0.366816,...,0.417796,0.270669,0.334941,0.512798,0.23978,0.076874,0.464702,0.507099,0.072293,0.040855
1,0.022837,0.710912,0.326307,0.031644,0.417817,0.001116,0.909643,0.446569,0.471538,0.898858,...,0.711519,0.129403,0.106711,0.157827,0.568332,0.878803,0.171053,0.731824,0.103271,0.529082
2,0.046297,0.967879,0.496282,0.243032,0.609019,0.430482,0.064071,0.406842,0.957454,0.65072,...,0.85567,0.741301,0.441996,0.029671,0.317708,0.444928,0.552225,0.145087,0.775265,0.111757
3,0.770105,0.835901,0.717827,0.341656,0.892734,0.513068,0.770297,0.151319,0.235085,0.516883,...,0.750003,0.891494,0.969619,0.341528,0.330378,0.209214,0.961123,0.20555,0.238348,0.368607
4,0.730972,0.301165,0.437069,0.06622,0.505229,0.562939,0.618855,0.900787,0.921749,0.622016,...,0.738609,0.84783,0.869849,0.929986,0.807636,0.74377,0.046009,0.841249,0.102994,0.539036

In [39]:
newdf

            0         1         2         3         4
0       0.333  0.022837  0.046297  0.770105  0.730972
1    0.550071  0.710912  0.967879  0.835901  0.301165
2    0.912403  0.326307  0.496282  0.717827  0.437069
3    0.717718  0.031644  0.243032  0.341656  0.066220
4    0.058916  0.417817  0.609019  0.892734  0.505229
..        ...       ...       ...       ...       ...
329  0.076874  0.878803  0.444928  0.209214  0.743770
330  0.464702  0.171053  0.552225  0.961123  0.046009
331  0.507099  0.731824  0.145087  0.205550  0.841249
332  0.072293  0.103271  0.775265  0.238348  0.102994
333  0.040855  0.529082  0.111757  0.368607  0.539036

[334 rows x 5 columns]

In [41]:
nd =newdf.head(5)

In [42]:
nd

          0         1         2         3         4
0     0.333  0.022837  0.046297  0.770105  0.730972
1  0.550071  0.710912  0.967879  0.835901  0.301165
2  0.912403  0.326307  0.496282  0.717827  0.437069
3  0.717718  0.031644  0.243032  0.341656  0.066220
4  0.058916  0.417817  0.609019  0.892734  0.505229

In [7]:
nd.sort_index(axis = 1, ascending = False)

NameError: name 'nd' is not defined

In [47]:
nd.sort_index(axis = 0, ascending = False)

          0         1         2         3         4
4  0.058916  0.417817  0.609019  0.892734  0.505229
3  0.717718  0.031644  0.243032  0.341656  0.066220
2  0.912403  0.326307  0.496282  0.717827  0.437069
1  0.550071  0.710912  0.967879  0.835901  0.301165
0     0.333  0.022837  0.046297  0.770105  0.730972

In [48]:
nd.head

<bound method NDFrame.head of           0         1         2         3         4
0     0.333  0.022837  0.046297  0.770105  0.730972
1  0.550071  0.710912  0.967879  0.835901  0.301165
2  0.912403  0.326307  0.496282  0.717827  0.437069
3  0.717718  0.031644  0.243032  0.341656  0.066220
4  0.058916  0.417817  0.609019  0.892734  0.505229>

In [49]:
nd[0]

0       0.333
1    0.550071
2    0.912403
3    0.717718
4    0.058916
Name: 0, dtype: object

In [52]:
type(nd)

pandas.core.frame.DataFrame

In [53]:
type(nd[0])

pandas.core.series.Series

In [54]:
ndnn = nd.copy()

In [55]:
# ndnn = nd

In [56]:
ndnn

          0         1         2         3         4
0     0.333  0.022837  0.046297  0.770105  0.730972
1  0.550071  0.710912  0.967879  0.835901  0.301165
2  0.912403  0.326307  0.496282  0.717827  0.437069
3  0.717718  0.031644  0.243032  0.341656  0.066220
4  0.058916  0.417817  0.609019  0.892734  0.505229

In [58]:
ndnn[0][0]=[6565105]

TypeError: 'int' object does not support item assignment

In [64]:
ndnn = nd.copy()

In [65]:
ndnn

          0         1         2         3         4
0     0.333  0.022837  0.046297  0.770105  0.730972
1  0.550071  0.710912  0.967879  0.835901  0.301165
2  0.912403  0.326307  0.496282  0.717827  0.437069
3  0.717718  0.031644  0.243032  0.341656  0.066220
4  0.058916  0.417817  0.609019  0.892734  0.505229

In [66]:
ndnn.loc[0,0] = 15423

In [67]:
ndnn

          0         1         2         3         4
0     15423  0.022837  0.046297  0.770105  0.730972
1  0.550071  0.710912  0.967879  0.835901  0.301165
2  0.912403  0.326307  0.496282  0.717827  0.437069
3  0.717718  0.031644  0.243032  0.341656  0.066220
4  0.058916  0.417817  0.609019  0.892734  0.505229

In [68]:
nd

          0         1         2         3         4
0     0.333  0.022837  0.046297  0.770105  0.730972
1  0.550071  0.710912  0.967879  0.835901  0.301165
2  0.912403  0.326307  0.496282  0.717827  0.437069
3  0.717718  0.031644  0.243032  0.341656  0.066220
4  0.058916  0.417817  0.609019  0.892734  0.505229

In [69]:
ndnn.head(2)

          0         1         2         3         4
0     15423  0.022837  0.046297  0.770105  0.730972
1  0.550071  0.710912  0.967879  0.835901  0.301165

In [70]:
ndnn.columns = list("ABCDE")

In [71]:
ndnn

          A         B         C         D         E
0     15423  0.022837  0.046297  0.770105  0.730972
1  0.550071  0.710912  0.967879  0.835901  0.301165
2  0.912403  0.326307  0.496282  0.717827  0.437069
3  0.717718  0.031644  0.243032  0.341656  0.066220
4  0.058916  0.417817  0.609019  0.892734  0.505229

In [72]:
ndnn.head(2)

          A         B         C         D         E
0     15423  0.022837  0.046297  0.770105  0.730972
1  0.550071  0.710912  0.967879  0.835901  0.301165

In [74]:
# for droping columns 

# . drop(0,axis =1 )

In [76]:
ndnn.loc[[1,2] ,["C" ,"D"]]

          C         D
1  0.967879  0.835901
2  0.496282  0.717827

In [77]:
ndnn.loc[[1,2] , :]

          A         B         C         D         E
1  0.550071  0.710912  0.967879  0.835901  0.301165
2  0.912403  0.326307  0.496282  0.717827  0.437069

In [79]:
ndnn.loc[(ndnn["A"] < 0.55)]

          A         B         C         D         E
4  0.058916  0.417817  0.609019  0.892734  0.505229

In [82]:
# you can use & |

In [83]:
ndnn.iloc[0,4]

0.7309717834257307

In [85]:
ndnn

          A         B         C         D         E
0     15423  0.022837  0.046297  0.770105  0.730972
1  0.550071  0.710912  0.967879  0.835901  0.301165
2  0.912403  0.326307  0.496282  0.717827  0.437069
3  0.717718  0.031644  0.243032  0.341656  0.066220
4  0.058916  0.417817  0.609019  0.892734  0.505229

In [87]:
# for use name use loc
# otherwise use iloc

In [88]:
ndnn.iloc[[0,3],[1,3]]

          B         D
0  0.022837  0.770105
3  0.031644  0.341656

In [89]:
ndnn.head(3)

          A         B         C         D         E
0     15423  0.022837  0.046297  0.770105  0.730972
1  0.550071  0.710912  0.967879  0.835901  0.301165
2  0.912403  0.326307  0.496282  0.717827  0.437069

In [90]:
ndnn.drop([0])

          A         B         C         D         E
1  0.550071  0.710912  0.967879  0.835901  0.301165
2  0.912403  0.326307  0.496282  0.717827  0.437069
3  0.717718  0.031644  0.243032  0.341656  0.066220
4  0.058916  0.417817  0.609019  0.892734  0.505229

In [92]:
ndnn.drop(['A', 'C'] ,axis =1)

          B         D         E
0  0.022837  0.770105  0.730972
1  0.710912  0.835901  0.301165
2  0.326307  0.717827  0.437069
3  0.031644  0.341656  0.066220
4  0.417817  0.892734  0.505229

In [93]:
ndnn

          A         B         C         D         E
0     15423  0.022837  0.046297  0.770105  0.730972
1  0.550071  0.710912  0.967879  0.835901  0.301165
2  0.912403  0.326307  0.496282  0.717827  0.437069
3  0.717718  0.031644  0.243032  0.341656  0.066220
4  0.058916  0.417817  0.609019  0.892734  0.505229

In [94]:
#  inplace is = true

In [95]:
#   .reset_index                drop = true   inplace true

In [96]:
ndnn.drop([1])

          A         B         C         D         E
0     15423  0.022837  0.046297  0.770105  0.730972
2  0.912403  0.326307  0.496282  0.717827  0.437069
3  0.717718  0.031644  0.243032  0.341656  0.066220
4  0.058916  0.417817  0.609019  0.892734  0.505229

In [97]:
ndnn.drop(["B"] , axis = 1)

          A         C         D         E
0     15423  0.046297  0.770105  0.730972
1  0.550071  0.967879  0.835901  0.301165
2  0.912403  0.496282  0.717827  0.437069
3  0.717718  0.243032  0.341656  0.066220
4  0.058916  0.609019  0.892734  0.505229

In [98]:
ndnn

          A         B         C         D         E
0     15423  0.022837  0.046297  0.770105  0.730972
1  0.550071  0.710912  0.967879  0.835901  0.301165
2  0.912403  0.326307  0.496282  0.717827  0.437069
3  0.717718  0.031644  0.243032  0.341656  0.066220
4  0.058916  0.417817  0.609019  0.892734  0.505229

In [99]:
# for duplicate    drop_duplicates()

In [100]:
ndnn["B"] = None

In [101]:
ndnn

          A     B         C         D         E
0     15423  None  0.046297  0.770105  0.730972
1  0.550071  None  0.967879  0.835901  0.301165
2  0.912403  None  0.496282  0.717827  0.437069
3  0.717718  None  0.243032  0.341656  0.066220
4  0.058916  None  0.609019  0.892734  0.505229

In [105]:
ndnn[["B"]].isnull()

      B
0  True
1  True
2  True
3  True
4  True

In [106]:
ndnn.loc[:, ["B"]] = 34

C:\Users\dhruv\AppData\Local\Temp\ipykernel_2184\698504783.py:1: FutureWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  ndnn.loc[:, ["B"]] = 34

In [107]:
ndnn

          A   B         C         D         E
0     15423  34  0.046297  0.770105  0.730972
1  0.550071  34  0.967879  0.835901  0.301165
2  0.912403  34  0.496282  0.717827  0.437069
3  0.717718  34  0.243032  0.341656  0.066220
4  0.058916  34  0.609019  0.892734  0.505229

In [119]:
ndnn.iloc[:, [1]] = 0

In [116]:
ndnn

          A   B         C         D         E
0     15423  34  0.046297  0.770105  0.730972
1  0.550071  34  0.967879  0.835901  0.301165
2  0.912403  34  0.496282  0.717827  0.437069
3  0.717718  34  0.243032  0.341656  0.066220
4  0.058916  34  0.609019  0.892734  0.505229

In [120]:
ndnn

          A  B         C         D         E
0     15423  0  0.046297  0.770105  0.730972
1  0.550071  0  0.967879  0.835901  0.301165
2  0.912403  0  0.496282  0.717827  0.437069
3  0.717718  0  0.243032  0.341656  0.066220
4  0.058916  0  0.609019  0.892734  0.505229

In [126]:
# drop_duplicates        subset   keep  


# df.shape

# df.info()

In [127]:
# .value_count    

#   drop  = False True

# .isnull()

In [128]:
creat dataframe which contain only 3 method 
df.describe()

SyntaxError: invalid syntax (569784971.py, line 1)

In [129]:
df.count()
df.min()
df.median()
df.mean()
df.corr()
df.std()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   work    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

C:\Users\dhruv\AppData\Local\Temp\ipykernel_2184\2934897180.py:3: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()
C:\Users\dhruv\AppData\Local\Temp\ipykernel_2184\2934897180.py:4: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()
C:\Users\dhruv\AppData\Local\Temp\ipykernel_2184\2934897180.py:5: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()
C:\Users\dhruv\AppData\Local\Temp\ipykernel_2184\2934897180.py:6: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

In [131]:
# .read_excle


# loc
# iloc

In [ ]:
# .xlsx